---
title: RoomTag
classe: Autodesk.Revit.DB.Architecture.RoomTag
namespace: Autodesk.Revit.DB.Architecture
eredita: Autodesk.Revit.DB.SpatialElementTag
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# RoomTag

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsInRoom { get; }` | `roomTag.IsInRoom` | Boolean |
| `Room Room { get; }` | `roomTag.Room` | Room |
| `RoomTagType RoomTagType { get; set; }` | `roomTag.RoomTagType` | RoomTagType |
| `ElementId TaggedLocalRoomId { get; }` | `roomTag.TaggedLocalRoomId` | ElementId |
| `LinkElementId TaggedRoomId { get; }` | `roomTag.TaggedRoomId` | LinkElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```